<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"69ae100c385c852db1c2c0ef84e3fc7a03dd36d308d6b0c5ea00f0db450fa510","plan_job_ref":"Job Test plan target and replace #394 at https://github.com/dflook/terraform-github-actions/actions/runs/7314697358","plan_hash":"5710fb3d6f5861ae07cefeca048acaa7e891c7a051d6e080effbc1a915814fae","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "GtQ8QzAw4B" -> (known after apply)
!~  foreach = "Jhcw11wji4" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #394](https://github.com/dflook/terraform-github-actions/actions/runs/7314697358)